# Readme
# To install these applications or bring them all to the latest version,
# copy the Brewfile to your Document folder and call the following command:
# brew bundle --file ~/Documents/Brewfile
# brew bundle install

# Install third-party repositories
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "buo/cask-upgrade"

# Install packages
brew "awscli"
brew "git"
brew "php"
brew "mas"
brew "node"
brew "ruby"
brew "python3"
brew "libxml2"
brew "libxslt"

# Essentials
cask "1password"
cask "archiver"
cask "arq"
cask "daisydisk"
cask "evernote"
cask "mullvadvpn"
cask "spotify"
cask "sublime-text"

# Create
cask "libreoffice"
cask "microsoft-auto-update"
cask "piezo"
mas "Affinity Photo", id: 824183456
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# Accessibility
cask "flux"

# Books reading
cask "calibre"
cask "delicious-library"
cask "kobo"
cask "logos"
mas "ReadKit: Read Later and RSS", id: 588726889

# Communicate
cask "microsoft-teams"
cask "slack"

# Cooking
mas "Paprika Recipe Manager", id: 451907568

# Finances
cask "quicken"

# Games
cask "steam"

# Web development
cask "codekit"
cask "colour-contrast-analyser"
cask "dash"
cask "datagrip"
cask "firefox"
cask "google-chrome"
cask "insomnia"
cask "kaleidoscope"
cask "local"
cask "microsoft-edge"
cask "poedit"
cask "sublime-merge"
cask "toggl"
cask "tower"
cask "transmit"
cask "visual-studio-code"
cask "font-fantasque-sans-mono"
cask "font-fantasquesansmono-nerd-font-mono"
cask "font-jetbrains-mono"
cask "font-jetbrainsmono-nerd-font"
cask "font-jetbrainsmono-nerd-font-mono"

# Utilities
cask "blackhole-16ch"
cask "imageoptim"
cask "launchpad-manager"
mas "Amphetamine", id: 937984704
mas "Better Rename 9", id: 414209656
mas "Deliveries", id: 924726344
mas "Yoink", id: 457622435
